# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries
brew 'git'
brew 'mas'
brew 'node'
brew 'wget'

# Development
brew 'tig'
brew 'pyenv'
brew 'diff-so-fancy'

# Apps
cask 'dropbox'
cask 'etcher'
cask 'firefox'
cask 'eloston-chromium'
cask 'gpgtools'
cask 'keepassx'
cask 'plex-home-theater'
cask 'private-internet-access'
cask 'pycharm'
cask 'shiftit'
cask 'sonos'
cask 'sqlitestudio'
cask 'torbrowser'
cask 'transmission'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'webstorm'

# App Store Apps
mas 'Xcode', id: 497799835
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
